{
  "backend/main.mo": "Main Motoko actor defining the backend canister with CRUD operations for properties, leads, and user profiles, using role-based access control (admin/user) and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (localStorage property seeding, Indian price formatting, property storage utilities, etc.) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key implementation details of every component, hook, utility, and page.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors for background, foreground, sidebar, charts, and UI primitives.",
  "frontend/index.html": "HTML shell for the Vite/React app with SEO meta tags, Google Fonts preconnect for Playfair Display and Inter, and a preload hint for the hero image.",
  "frontend/src/App.tsx": "Root React component that performs simple pathname-based routing to render PropertyPage, AdminPanel, PrivacyPolicy, TermsConditions, or the default home page layout, wrapped in a React Query provider.",
  "frontend/src/components/About.tsx": "About section component featuring an IntersectionObserver-triggered animated counter, agent portrait, stats grid, specializations, and certifications for Alexander Reid.",
  "frontend/src/components/admin/LeadsManager.tsx": "Admin panel component that fetches and displays all leads in a table with loading skeletons, error handling, and a CSV download button.",
  "frontend/src/components/admin/LocalPropertyFormModal.tsx": "A dialog form modal for creating or editing locally-stored properties, with city selection, photo URLs, coordinates, and validation before saving to local storage.",
  "frontend/src/components/admin/PropertiesManager.tsx": "Admin panel component for managing backend properties with search, pagination, add/edit/delete actions, and a confirmation dialog for deletions.",
  "frontend/src/components/admin/PropertyFormModal.tsx": "A dialog form modal for creating or editing backend Property records, with validation and submission via React Query mutation hooks.",
  "frontend/src/components/CompareButton.tsx": "Floating compare button that appears when two or more properties are selected in CompareContext, displaying the count and triggering a comparison action on click.",
  "frontend/src/components/CompareModal.tsx": "A modal component that displays a side-by-side comparison of up to several demo luxury properties, showing details like price, bedrooms, and square footage, with keyboard and click-outside close support.",
  "frontend/src/components/Contact.tsx": "A contact form section for booking a private consultation, with fields for name, phone, email, budget, property type, and message, submitted via Formspree with client-side validation and honeypot spam protection.",
  "frontend/src/components/CookieBanner.tsx": "A fixed bottom cookie consent banner that shows once per session, storing the user's accept or decline choice in localStorage.",
  "frontend/src/components/CustomCursor.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/EMICalculator.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/Footer.tsx": "A site footer displaying brand info, RERA registration, social links, contact details, and quick navigation links for a Delhi luxury real estate agent site.",
  "frontend/src/components/Hero.tsx": "A full-screen hero section with a Delhi skyline background, agent credentials (RERA, experience, CREDAI), and CTA buttons to view properties or book a consultation.",
  "frontend/src/components/LandInvestment.tsx": "A section displaying four hardcoded land investment listings with zoning, pricing, infrastructure details, and a CTA to scroll to the consultation form.",
  "frontend/src/components/LoadingScreen.tsx": "A full-screen loading overlay with a spinning gold animation that fades out after 1.5 seconds and calls an onComplete callback.",
  "frontend/src/components/MarketTicker.tsx": "Empty file with no content or implementation.",
  "frontend/src/components/MobileBottomBar.tsx": "A fixed mobile-only bottom bar with two buttons that smooth-scroll to the properties and consultation sections respectively.",
  "frontend/src/components/Navbar.tsx": "Responsive navigation bar with scroll-aware styling, smooth-scroll anchor links, and a full-screen mobile menu overlay.",
  "frontend/src/components/Properties.tsx": "Section component that loads properties from local storage, filters them by city via tab buttons, and renders them in a responsive grid of PropertyCards.",
  "frontend/src/components/PropertyCard.tsx": "Card component displaying a property's image, city badge, enquiry count, price, and action buttons to view details or scroll to the enquiry form.",
  "frontend/src/components/PropertyMatcher.tsx": "Empty file with no implementation.",
  "frontend/src/components/PropertyModal.tsx": "Modal overlay that displays detailed information (image, specs, price) for a backend Property object, with keyboard and backdrop close support.",
  "frontend/src/components/ScrollProgressBar.tsx": "Fixed top progress bar that visually indicates scroll depth on the page using a gold gradient.",
  "frontend/src/components/TestimonialsRotator.tsx": "Carousel section displaying a rotating set of five hardcoded verified client testimonials with navigation arrows and star ratings.",
  "frontend/src/components/VictoryOverlay.tsx": "Empty file with no implementation.",
  "frontend/src/components/WishlistButton.tsx": "Fixed floating action button that shows the wishlist item count and is only visible when the wishlist is non-empty.",
  "frontend/src/components/WishlistDrawer.tsx": "A slide-in drawer component that displays the user's wishlisted properties, falling back to demo properties if the backend returns none, with remove functionality and Escape key support.",
  "frontend/src/contexts/CompareContext.tsx": "React context that manages a list of up to 3 property IDs selected for comparison, exposing toggle, check, and clear operations.",
  "frontend/src/contexts/LanguageContext.tsx": "Empty file with no content.",
  "frontend/src/contexts/WishlistContext.tsx": "React context that persists a list of wishlisted property IDs to localStorage, exposing toggle, check, and remove operations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity state tracking via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for CRUD operations on properties and leads, wrapping backend actor calls with useQuery and useMutation and invalidating relevant caches on mutations.",
  "frontend/src/index.css": "Global stylesheet that imports Inter font, sets up Tailwind layers, defines CSS custom properties for the design system (navy brand colors, spacing, etc.), and adds utility animations and custom scrollbar styles.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the root DOM element.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page that requires Internet Identity authentication and provides a UI for viewing, adding, editing, and deleting local properties using localStorage-backed utilities.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Static page rendering the Privacy Policy with sections covering data collection, usage, sharing, cookies, security, GDPR rights, retention, and contact information.",
  "frontend/src/pages/PropertyPage.tsx": "Detail page for a single property, loaded by ID from URL params via localStorage. Features a touch-swipeable photo carousel, property info display, Google Maps link, and contact/WhatsApp buttons.",
  "frontend/src/pages/TermsConditions.tsx": "Static Terms & Conditions page for Alexander Reid luxury real estate, rendering 8 legal sections with a dark luxury theme using Playfair and Inter fonts.",
  "frontend/src/translations/translations.ts": "Empty translations file with no exported content.",
  "frontend/src/types/property.ts": "Defines the LocalProperty TypeScript interface with fields for id, city, title, price, photos (3-tuple), enquiryCount, location, lat, and lng.",
  "frontend/src/utils/formatIndianPrice.ts": "Utility function that formats a raw integer into Indian currency format with ₹ symbol (e.g. 2800000000 → ₹28,00,00,000).",
  "frontend/src/utils/propertyStorage.ts": "localStorage CRUD module for properties using key 'dlx_properties', seeding 15 hardcoded NCR luxury properties (Delhi, Gurgaon, Noida, Aerocity, Ghaziabad) on first load.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with navy/off-white/gray color palette, Inter font, custom animations (fadeIn, slideUp, accordion), and typography/animate plugins.",
  "project_state.json": "Project state manifest describing the Delhi Luxury Empire real estate site: 15 hardcoded demo properties, localStorage persistence, admin panel with Internet Identity, Indian price formatting, and known architectural decisions."
}