{
  "backend/main.mo": "Main Motoko actor defining Lead, Property, and UserProfile types with CRUD operations, role-based access control (admin/user/guest), and mixin includes for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report mapping a single cycling/rotating text animation feature (Contact section spans) to its implementation files and test ID REQ-30.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for every frontend source file, describing each component's purpose, key dependencies, and notable implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, charts, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the Vite app titled 'Delhi Luxury Empire', loading Playfair Display, Montserrat, and Noto Sans Devanagari fonts and mounting the React app at #root.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with / and /admin routes, wraps the app in QueryClientProvider and LanguageProvider, and renders LoadingScreen, ScrollProgressBar, and CustomCursor.",
  "frontend/src/components/About.tsx": "About section displaying agent stats, bio, and testimonials with IntersectionObserver-driven staggered fade-up animations on child elements.",
  "frontend/src/components/admin/LeadsManager.tsx": "Admin component that displays all leads in a table with loading/error states and provides a CSV download button for exporting lead data.",
  "frontend/src/components/admin/PropertiesManager.tsx": "Admin component for managing property listings, supporting add, edit, and delete operations via a table UI with a modal form and confirmation dialogs.",
  "frontend/src/components/admin/PropertyFormModal.tsx": "Modal dialog form for creating or editing a property, with validation and submission handled via create/update mutation hooks.",
  "frontend/src/components/Contact.tsx": "Contact section with a glassmorphism lead-capture form, bilingual labels via useLanguage, VictoryOverlay on successful submission, and a rotating-heading-wrapper with two CSS-animated spans cycling one at a time.",
  "frontend/src/components/CustomCursor.tsx": "Renders a custom gold key-shaped SVG cursor with a trailing spark particle effect using requestAnimationFrame and mouse event listeners.",
  "frontend/src/components/EMICalculator.tsx": "A slide-in EMI calculator panel that computes monthly mortgage payments from property price, down payment, tenure, and interest rate, with a canvas-based gold particle burst animation on recalculation.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying the agent's branding, copyright year, and a caffeine.ai attribution link.",
  "frontend/src/components/Hero.tsx": "Full-viewport hero section with an animated canvas of rising gold particles and a mouse-move parallax effect on the text layer, supporting English and Hindi via a language context.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen loading overlay that displays a spinning gold animation and branding text, then fades out and calls an onComplete callback after 2 seconds.",
  "frontend/src/components/MarketTicker.tsx": "Horizontally scrolling marquee ticker bar showing real estate price growth percentages for various Delhi-NCR regions.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation bar with scroll-aware background blur, anchor links, a language toggle button, and a responsive mobile menu, supporting English and Hindi labels.",
  "frontend/src/components/Properties.tsx": "Renders the properties section with a grid of PropertyCard components, using fetched data or fallback hardcoded Delhi/Gurgaon luxury listings. Includes intersection observer animations and integrates the PropertyMatcher sidebar for filtering.",
  "frontend/src/components/PropertyCard.tsx": "Displays a single property as a 3D flip card with mouse-tilt effect, showing image and price on the front and details on the back. Opens a PropertyModal on click and highlights matched properties with a gold outline.",
  "frontend/src/components/PropertyMatcher.tsx": "A fixed sidebar panel that lets users filter properties by budget and location, returning up to 3 matched property IDs via a callback. Toggles open/closed with an animated vertical tab button.",
  "frontend/src/components/PropertyModal.tsx": "A full-screen modal overlay that displays detailed information (image, title, location, price, description) for a selected property. Closes on backdrop click or the close button.",
  "frontend/src/components/ScrollProgressBar.tsx": "A fixed top progress bar that tracks and displays scroll depth as a percentage using a requestAnimationFrame-throttled scroll listener.",
  "frontend/src/components/VictoryOverlay.tsx": "A full-screen celebration overlay with a canvas-based confetti animation and a 'Deal Locked!' message. Allows closing after a 3-second delay with a fade-out transition.",
  "frontend/src/contexts/LanguageContext.tsx": "React context providing English/Hindi language toggling with localStorage persistence and a translation lookup function.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an ICP backend actor using the current Internet Identity, initializing admin access control if an admin token is present in the URL.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, login, and logout via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on properties and leads, delegating calls to the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, CSS custom properties for a dark luxury theme (gold/crimson/obsidian palette), and reusable component classes like glassmorphism, gold gradients, and luxury button/card/input styles.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication wrapping the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page that gates access behind Internet Identity authentication, showing a login screen when unauthenticated and a tabbed dashboard with PropertiesManager and LeadsManager components when authenticated.",
  "frontend/src/translations/translations.ts": "Bilingual (English and Hindi) translation map for all UI string keys used across the app, covering navigation, hero section, contact form, and property matcher labels.",
  "frontend/src/utils/formatIndianPrice.ts": "Utility functions to format numbers into Indian price notation with ₹ symbol (e.g., 28000000 → ₹2,80,00,000) and to parse price strings containing Cr/L/lakh suffixes back into numeric rupee values.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with luxury brand colors (gold, crimson, obsidian), custom fonts (Playfair Display, Montserrat), gold glow shadows, and animations like shimmer and fade-in-up.",
  "project_state.json": "Tracks project state (version 11) for a luxury Delhi real estate portfolio site with React/TypeScript on Internet Computer, documenting completed phases, architectural decisions, deferred features, and known issues."
}