{
  "kind": "build_request",
  "title": "Rotating one-per-line span animation in 6th section",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "In the 6th section of the page, locate the parent container at XPath /html[1]/body[1]/div[1]/div[6]/div[1]/div[1] and its two child <span> elements (XPath span[1] and span[2]). Stack the two spans vertically so each appears on its own line (display: block or flex-direction: column on the parent). Implement a CSS animation that cycles through the spans one at a time: each span fades/slides in, stays visible for ~2 seconds, then fades/slides out before the next one appears, creating a continuous rotating/cycling text effect. Use CSS keyframe animations with an appropriate staggered animation-delay so span[2] begins its cycle after span[1] has completed its display window. The transition between spans must be smooth (opacity + translateY, approximately 0.4s ease). Do not alter any other elements outside this container.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "make them rotating and one by one line"
        ]
      },
      "acceptanceCriteria": [
        "The two span elements inside the targeted container are stacked vertically (one per line), not side by side.",
        "Only one span is fully visible at a time; the other is hidden or mid-transition.",
        "The spans cycle continuously — span[1] appears, then span[2], then back to span[1] — in an infinite loop.",
        "The transition between spans uses a smooth fade or slide animation (~0.4s).",
        "Each span remains fully visible for approximately 2 seconds before transitioning out.",
        "No other elements on the page are affected by this change."
      ]
    }
  ],
  "constraints": [
    "Only modify the two <span> elements at XPath /html[1]/body[1]/div[1]/div[6]/div[1]/div[1]/span[1] and span[2] and their immediate parent container.",
    "Do not replace or remove any existing GSAP animations elsewhere on the page.",
    "Implement using CSS keyframe animations or transitions only — no JavaScript-driven animation for this element."
  ],
  "nonGoals": [
    "Modifying any other section or component outside the 6th section targeted container.",
    "Adding new text content or changing the existing span text values.",
    "Replacing or altering any existing GSAP, Three.js, or canvas animations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}